# — — — — — — — Задание №1 — — — — — —
print("Hello, World!")
print("Маша + Петя = Любовь")
print("x = 3 + 4 ")
print(3 + 4)

# — — — — — — — Задание №2 — — — — — —
x= 'Hello, World!'
print(type(x))
r= 3 + 4
print(type(r))
a= 3 / 4
print(type(a))
z= [1, 2, 5, 10, 100]
print(type(z))

# — — — — — — — Задание №4 — — — — — —
a= ["1", "5", "Good", "Bad"]
b= ["9", "Blue", "Red", "11"]


print (str(a[1])+str(b[2]))
print (str(a[2])+str(b[2]))
print (int(a[0]) * int(b[0]))
print (int(a[1]) ** int(b[3]))
print (a + b)

# — — — — — — — Задание №5 — — — — — —

atomicheart="Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. ."
print(atomicheart)
xraz = str(input("Введите недостоющее слов, покрытая ..."))
p3= str(input("Введите недостоющую букву, кожиц..й "))
vav= str(input("Введите недостоющее слово, держится на ... "))
trzh= str(input("Введите недостоющую букву,ножк.. "))
sech= str(input("Введите недостоющее слово, затянута .. пленкой  "))
ys= str(input("Введите недостоющую слово, нижняя ... "))
ussr= str(input("Введите недостоющую букву, шляпк..  "))



print("Шляпка гриба, покрытая" + "ㅤ" + xraz + "ㅤ" +p3 + "ㅤ"+ ", держится на" + "ㅤ"+ vav +"ㅤ" +trzh + ""  ". Снизу шляпка затянута" + "ㅤ" +sech + "ㅤ" + "плёнкой. Когда её уберёшь, откроется нижняя" + "ㅤ" + ys + "ㅤ" + "сторона" + "ㅤ" + ussr + "ㅤ" + "." )
